verses = {
  "Adultery": { "location":"Matthew 5:28", "esv":"But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.", "kjv":"But I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart.", "nlt":"But I say, anyone who even looks at a woman with lust has already committed adultery with her in his heart."},
  "Ambition": { "location":"Philippians 2:2-4", "esv":"complete my joy by being of the same mind, having the same love, being in full accord and of one mind. Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves. Let each of you look not only to his own interests, but also to the interests of others.", "kjv":"Fulfil ye my joy, that ye be likeminded, having the same love, being of one accord, of one mind. Let nothing be done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others.", "nlt":"Then make me truly happy by agreeing wholeheartedly with each other, loving one another, and working together with one mind and purpose. Don’t be selfish; don’t try to impress others. Be humble, thinking of others as better than yourselves. Don’t look out only for your own interests, but take an interest in others, too."},
  "Anxiety": { "location":"Matthew 6:31-34", "esv":"Therefore do not be anxious, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’ For the Gentiles seek after all these things, and your heavenly Father knows that you need them all. But seek first the kingdom of God and his righteousness, and all these things will be added to you. “Therefore do not be anxious about tomorrow, for tomorrow will be anxious for itself. Sufficient for the day is its own trouble.", "kjv":"Therefore take no thought, saying, What shall we eat? or, What shall we drink? or, Wherewithal shall we be clothed? (For after all these things do the Gentiles seek:) for your heavenly Father knoweth that ye have need of all these things. But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you. Take therefore no thought for the morrow: for the morrow shall take thought for the things of itself. Sufficient unto the day is the evil thereof.", "nlt":"So don’t worry about these things, saying, ‘What will we eat? What will we drink? What will we wear?’ These things dominate the thoughts of unbelievers, but your heavenly Father already knows all your needs. Seek the Kingdom of God above all else, and live righteously, and he will give you everything you need. “So don’t worry about tomorrow, for tomorrow will bring its own worries. Today’s trouble is enough for today."},
  "Compassion": { "location":"Psalm 103:8-11", "esv":"The Lord is merciful and gracious, slow to anger and abounding in steadfast love. He will not always chide, nor will he keep his anger forever. He does not deal with us according to our sins,nor repay us according to our iniquities. For as high as the heavens are above the earth, so great is his steadfast love toward those who fear him;", "kjv":"The Lord is merciful and gracious, slow to anger, and plenteous in mercy. He will not always chide: neither will he keep his anger for ever. He hath not dealt with us after our sins; nor rewarded us according to our iniquities. For as the heaven is high above the earth, so great is his mercy toward them that fear him.", "nlt":"The Lord is compassionate and merciful, slow to get angry and filled with unfailing love. He will not constantly accuse us, nor remain angry forever. He does not punish us for all our sins; he does not deal harshly with us, as we deserve. For his unfailing love toward those who fear him is as great as the height of the heavens above the earth."},
  "Death": { "location":"Romans 14:8", "esv":"For if we live, we live to the Lord, and if we die, we die to the Lord. So then, whether we live or whether we die, we are the Lord’s.", "kjv":"For whether we live, we live unto the Lord; and whether we die, we die unto the Lord: whether we live therefore, or die, we are the Lord's.", "nlt":"If we live, we live for the Lord; and if we die, we die for the Lord. So, whether we live or die, we belong to the Lord."},
  "Faith": { "location":"Proverbs 3:5-6", "esv":"Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.", "kjv":"Trust in the Lord with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge him, and he shall direct thy paths.", "nlt":"Trust in the Lord with all your heart; do not depend on your own understanding. Seek his will in all you do, and he will show you which path to take."},
  "Greed": { "location":"Matthew 6:24", "esv":"No one can serve two masters, for either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve God and money.", "kjv":"No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Ye cannot serve God and mammon.", "nlt":"No one can serve two masters. For you will hate one and love the other; you will be devoted to one and despise the other. You cannot serve both God and money."},
  "Heaven": { "location":"Revelation 21:4", "esv":"He will wipe away every tear from their eyes, and death shall be no more, neither shall there be mourning, nor crying, nor pain anymore, for the former things have passed away.”", "kjv":"And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain: for the former things are passed away.", "nlt":"He will wipe every tear from their eyes. There will be no more death' or mourning or crying or pain, for the old order of things has passed away."},
  "Hope": { "location":"Romans 15:13", "esv":"May the God of hope fill you with all joy and peace in believing, so that by the power of the Holy Spirit you may abound in hope.", "kjv":"Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost.", "nlt":"I pray that God, the source of hope, will fill you completely with joy and peace because you trust in him. Then you will overflow with confident hope through the power of the Holy Spirit."},
  "Hypocrisy": { "location":"Matthew 7:3-5", "esv":"Why do you see the speck that is in your brother's eye, but do not notice the log that is in your own eye? Or how can you say to your brother, ‘Let me take the speck out of your eye,’ when there is the log in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take the speck out of your brother's eye.", "kjv":"And why beholdest thou the mote that is in thy brother's eye, but considerest not the beam that is in thine own eye? Or how wilt thou say to thy brother, Let me pull out the mote out of thine eye; and, behold, a beam is in thine own eye? Thou hypocrite, first cast out the beam out of thine own eye; and then shalt thou see clearly to cast out the mote out of thy brother's eye.", "nlt":"“And why worry about a speck in your friend’s eye when you have a log in your own? How can you think of saying to your friend, ‘Let me help you get rid of that speck in your eye,’ when you can’t see past the log in your own eye? Hypocrite! First get rid of the log in your own eye; then you will see well enough to deal with the speck in your friend’s eye."},
  "Joy": { "location":"Psalm 5:11-12", "esv":"But let all who take refuge in you rejoice; let them ever sing for joy, and spread your protection over them, that those who love your name may exult in you. For you bless the righteous, O Lord; you cover him with favor as with a shield.", "kjv":"But let all those that put their trust in thee rejoice: let them ever shout for joy, because thou defendest them: let them also that love thy name be joyful in thee. For thou, Lord, wilt bless the righteous; with favour wilt thou compass him as with a shield.", "nlt":"But let all who take refuge in you rejoice; let them sing joyful praises forever. Spread your protection over them, that all who love your name may be filled with joy. For you bless the godly, O Lord; you surround them with your shield of love."},
  "Loneliness": { "location":"Psalm 73:25-26", "esv":"Whom have I in heaven but you? And there is nothing on earth that I desire besides you. My flesh and my heart may fail, but God is the strength of my heart and my portion forever.", "kjv":"Whom have I in heaven but thee? and there is none upon earth that I desire beside thee. My flesh and my heart faileth: but God is the strength of my heart, and my portion for ever.", "nlt":"Whom have I in heaven but you? I desire you more than anything on earth. My health may fail, and my spirit may grow weak, but God remains the strength of my heart; he is mine forever."},
  "Love": { "location":"1 Corinthians 13:4-7", "esv":"Love is patient and kind; love does not envy or boast; it is not arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice at wrongdoing, but rejoices with the truth. Love bears all things, believes all things, hopes all things, endures all things.", "kjv":"Charity suffereth long, and is kind; charity envieth not; charity vaunteth not itself, is not puffed up, doth not behave itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil; rejoiceth not in iniquity, but rejoiceth in the truth; beareth all things, believeth all things, hopeth all things, endureth all things.", "nlt":"Love is patient and kind. Love is not jealous or boastful or proud or rude. It does not demand its own way. It is not irritable, and it keeps no record of being wronged. It does not rejoice about injustice but rejoices whenever the truth wins out. Love never gives up, never loses faith, is always hopeful, and endures through every circumstance."},
  "Peace": { "location":"John 16:33", "esv":"I have said these things to you, that in me you may have peace. In the world you will have tribulation. But take heart; I have overcome the world.”", "kjv":"These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world.", "nlt":"I have told you all this so that you may have peace in me. Here on earth you will have many trials and sorrows. But take heart, because I have overcome the world.”"},
  "Pride": { "location":"Psalm 101:5", "esv":"Whoever slanders his neighbor secretly I will destroy. Whoever has a haughty look and an arrogant heart I will not endure.", "kjv":"Whoso privily slandereth his neighbour, him will I cut off: him that hath an high look and a proud heart will not I suffer.", "nlt":"I will not tolerate people who slander their neighbors. I will not endure conceit and pride."},
  "Revenge": { "location":"Romans 12:19-20", "esv":"Beloved, never avenge yourselves, but leave it to the wrath of God, for it is written, “Vengeance is mine, I will repay, says the Lord.” To the contrary, “if your enemy is hungry, feed him; if he is thirsty, give him something to drink; for by so doing you will heap burning coals on his head.”", "kjv":"Dearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, Vengeance is mine; I will repay, saith the Lord. Therefore if thine enemy hunger, feed him; if he thirst, give him drink: for in so doing thou shalt heap coals of fire on his head.", "nlt":"Dear friends, never take revenge. Leave that to the righteous anger of God. For the Scriptures say, “I will take revenge; I will pay them back,” says the Lord. Instead, “If your enemies are hungry, feed them. If they are thirsty, give them something to drink. In doing this, you will heap burning coals of shame on their heads.”"},
  "You fail": { "location":"Jeremiah 29:11", "esv":"For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope.", "kjv":"For I know the thoughts that I think toward you, saith the Lord, thoughts of peace, and not of evil, to give you an expected end.", "nlt":"For I know the plans I have for you,” says the Lord. “They are plans for good and not for disaster, to give you a future and a hope."},
  "You doubt": { "location":"Psalm 34:1-4", "esv":"I will bless the Lord at all times;his praise shall continually be in my mouth. My soul makes its boast in the Lord; let the humble hear and be glad. Oh, magnify the Lord with me, and let us exalt his name together! I sought the Lord, and he answered me and delivered me from all my fears.", "kjv":"I will bless the Lord at all times: his praise shall continually be in my mouth. My soul shall make her boast in the Lord: the humble shall hear thereof, and be glad. O magnify the Lord with me, and let us exalt his name together. I sought the Lord, and he heard me, and delivered me from all my fears.", "nlt":"I will praise the Lord at all times. I will constantly speak his praises. I will boast only in the Lord; let all who are helpless take heart. Come, let us tell of the Lord’s greatness; let us exalt his name together. I prayed to the Lord, and he answered me. He freed me from all my fears."},
  "You're bitter": { "location":"Hebrews 12:14-15", "esv":"Strive for peace with everyone, and for the holiness without which no one will see the Lord. See to it that no one fails to obtain the grace of God; that no “root of bitterness” springs up and causes trouble, and by it many become defiled;", "kjv":"Follow peace with all men, and holiness, without which no man shall see the Lord: Looking diligently lest any man fail of the grace of God; lest any root of bitterness springing up trouble you, and thereby many be defiled;", "nlt":"Work at living in peace with everyone, and work at living a holy life, for those who are not holy will not see the Lord. Look after each other so that none of you fails to receive the grace of God. Watch out that no poisonous root of bitterness grows up to trouble you, corrupting many."},
  "You're afraid": { "location":"2 Timothy 1:7", "esv":"for God gave us a spirit not of fear but of power and love and self-control.", "kjv":"For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind.", "nlt":"For God has not given us a spirit of fear and timidity, but of power, love, and self-discipline."},
  "You're depressed": { "location":"Deuteronomy 31:8", "esv":"It is the LORD who goes before you. He will be with you; he will not leave you or forsake you. Do not fear or be dismayed.”", "kjv":"And the LORD, he it is that doth go before thee; he will be with thee, he will not fail thee, neither forsake thee: fear not, neither be dismayed.", "nlt":"Do not be afraid or discouraged, for the LORD will personally go ahead of you. He will be with you; he will neither fail you nor abandon you."},
  "You're tempted": { "location":"1 Corinthians 10:13", "esv":"No temptation has overtaken you that is not common to man. God is faithful, and he will not let you be tempted beyond your ability, but with the temptation he will also provide the way of escape, that you may be able to endure it.", "kjv":"There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it.", "nlt":"The temptations in your life are no different from what others experience. And God is faithful. He will not allow the temptation to be more than you can stand. When you are tempted, he will show you a way out so that you can endure."},
  "You're angry": { "location":"Proverbs 16:32", "esv":"Whoever is slow to anger is better than the mighty, and he who rules his spirit than he who takes a city.", "kjv":"He that is slow to anger is better than the mighty; and he that ruleth his spirit than he that taketh a city.", "nlt":"Better to be patient than powerful; better to have self-control than to conquer a city."},
  "You're jealous": { "location":"James 3:16", "esv":"For where jealousy and selfish ambition exist, there will be disorder and every vile practice.", "kjv":"For where envying and strife is, there is confusion and every evil work.", "nlt":"For wherever there is jealousy and selfish ambition, there you will find disorder and evil of every kind."},
  "You're in need": { "location":"1 John 5:14-15", "esv":"And this is the confidence that we have toward him, that if we ask anything according to his will he hears us. And if we know that he hears us in whatever we ask, we know that we have the requests that we have asked of him.", "kjv":"And this is the confidence that we have in him, that, if we ask any thing according to his will, he heareth us: And if we know that he hear us, whatsoever we ask, we know that we have the petitions that we desired of him.", "nlt":"And we are confident that he hears us whenever we ask for anything that pleases him. And since we know he hears us when we make our requests, we also know that he will give us what we ask for."},
  "You're weak": { "location":"2 Corinthians 12:9", "esv":"But he said to me, “My grace is sufficient for you, for my power is made perfect in weakness.” Therefore I will boast all the more gladly of my weaknesses, so that the power of Christ may rest upon me.", "kjv":"And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me.", "nlt":"Each time he said, “My grace is all you need. My power works best in weakness.” So now I am glad to boast about my weaknesses, so that the power of Christ can work through me."}
}